In [1]:
import mysql.connector as conn
mydb = conn.connect (host = 'localhost', user = 'root', passwd = '12345678')
cursor = mydb.cursor(buffered=True)

In [2]:
cursor.execute('show databases')
cursor.fetchall()

[('information_schema',), ('mysql',), ('performance_schema',), ('sys',)]

In [3]:
cursor.execute('create database fsds')
cursor.execute('create table fsds.glassdata(col1 INT(10), col2 float(10,5), col3 float(10,5), col4 float(10,5), col5 float(10,5), col6 float(10,5), col7 float(10,5), col8 float(10,5), col9 float(10,5), col10 float(10,5), col11 INT(10))')
cursor.execute('use fsds')

import csv
with open('data/glass.data', 'r') as f:
    glass_data = csv.reader(f, delimiter = '\n')
    # print(glass_data)

    for i in glass_data:
        # print(i[0])
        # print(f'insert into glassdata values ({str(i[0])})')
        cursor.execute('insert into fsds.glassdata values ({values})'.format(values = i[0]))

mydb.commit()

In [4]:
cursor.execute('select * from fsds.glassdata')
cursor.fetchone()

(1, 1.52101, 13.64, 4.49, 1.1, 71.78, 0.06, 8.75, 0.0, 0.0, 1)

### Selecting certain columns from a table

In [5]:
cursor.execute('select col1, col5, col10 from fsds.glassdata')
cursor.fetchmany(10)

[(1, 1.1, 0.0),
 (2, 1.36, 0.0),
 (3, 1.54, 0.0),
 (4, 1.29, 0.0),
 (5, 1.24, 0.0),
 (6, 1.62, 0.26),
 (7, 1.14, 0.0),
 (8, 1.05, 0.0),
 (9, 1.37, 0.0),
 (10, 1.36, 0.11)]

### Filtering while selecting

In [6]:
cursor.execute('select * from fsds.glassdata where col4 = 3.61')
cursor.fetchall()

[(6, 1.51596, 12.79, 3.61, 1.62, 72.97, 0.64, 8.07, 0.0, 0.26, 1),
 (8, 1.51756, 13.15, 3.61, 1.05, 73.24, 0.57, 8.24, 0.0, 0.0, 1),
 (77, 1.51645, 13.44, 3.61, 1.54, 72.39, 0.66, 8.03, 0.0, 0.0, 2),
 (127, 1.51667, 12.94, 3.61, 1.26, 72.75, 0.56, 8.6, 0.0, 0.0, 2)]

In [7]:
cursor.execute('select * from fsds.glassdata where col4 = 3.61 and col10 = 0 and col11 = 2')
cursor.fetchall()

[(77, 1.51645, 13.44, 3.61, 1.54, 72.39, 0.66, 8.03, 0.0, 0.0, 2),
 (127, 1.51667, 12.94, 3.61, 1.26, 72.75, 0.56, 8.6, 0.0, 0.0, 2)]

### Deleting rows from table

In [8]:
cursor.execute('delete from fsds.glassdata where col1 = 1')
cursor.execute('select * from fsds.glassdata where col1 = 1')
cursor.fetchall()

[]

since we changed a table by deleting a row, we have to commit our changes

In [9]:
mydb.commit()

### Update in sql

In [10]:
cursor.execute('UPDATE fsds.glassdata set col1 = 1, col2 = 0 where col1 = 77')

In [11]:
mydb.commit()

In [12]:
cursor.execute('select * from fsds.glassdata where col1 = 1')
cursor.fetchall()

[(1, 0.0, 13.44, 3.61, 1.54, 72.39, 0.66, 8.03, 0.0, 0.0, 2)]

### GROUP BY

In [13]:
cursor.execute('select col1, count(col2) as cnt from fsds.glassdata where col1 < 6 group by col1')
cursor.fetchall()

[(2, 1), (3, 1), (4, 1), (5, 1), (1, 1)]

In [14]:
cursor.execute('select col1, count(col1), col11 from fsds.glassdata where col1 < 6 group by col1, col11')
cursor.fetchall()

[(2, 1, 1), (3, 1, 1), (4, 1, 1), (5, 1, 1), (1, 1, 2)]

In [15]:
# finding duplicates in col2
cursor.execute('select col2, count(*) as cnt from fsds.glassdata group by col2 order by cnt desc')
cursor.fetchmany(10)

[(1.52152, 3),
 (1.5159, 3),
 (1.51761, 2),
 (1.51618, 2),
 (1.51596, 2),
 (1.51743, 2),
 (1.51755, 2),
 (1.51763, 2),
 (1.51784, 2),
 (1.51793, 2)]

### DELETING A TABLE

In [16]:
cursor.execute('drop table fsds.glassdata')

In [17]:
mydb.commit()

In [18]:
cursor.execute('use fsds')
cursor.execute('show tables')
cursor.fetchall()

[]

recreate table glassdata

In [19]:
cursor.execute('create table glassdata(col1 INT(10), col2 float(10,5), col3 float(10,5), col4 float(10,5), col5 float(10,5), col6 float(10,5), col7 float(10,5), col8 float(10,5), col9 float(10,5), col10 float(10,5), col11 INT(10))')
cursor.execute('use fsds')

import csv
with open('data/glass.data', 'r') as f:
    glass_data = csv.reader(f, delimiter = '\n')
    # print(glass_data)

    for i in glass_data:
        cursor.execute('insert into glassdata values ({values})'.format(values = i[0]))

mydb.commit()

In [20]:
cursor.execute('select * from fsds.glassdata')
cursor.fetchmany(5)

[(1, 1.52101, 13.64, 4.49, 1.1, 71.78, 0.06, 8.75, 0.0, 0.0, 1),
 (2, 1.51761, 13.89, 3.6, 1.36, 72.73, 0.48, 7.83, 0.0, 0.0, 1),
 (3, 1.51618, 13.53, 3.55, 1.54, 72.99, 0.39, 7.78, 0.0, 0.0, 1),
 (4, 1.51766, 13.21, 3.69, 1.29, 72.61, 0.57, 8.22, 0.0, 0.0, 1),
 (5, 1.51742, 13.27, 3.62, 1.24, 73.08, 0.55, 8.07, 0.0, 0.0, 1)]

In [21]:
cursor.execute('select * from glassdata where col2 like \'1.515%\'')
cursor.fetchmany(5)

[(6, 1.51596, 12.79, 3.61, 1.62, 72.97, 0.64, 8.07, 0.0, 0.26, 1),
 (11, 1.51571, 12.72, 3.46, 1.56, 73.2, 0.67, 8.09, 0.0, 0.24, 1),
 (13, 1.51589, 12.88, 3.43, 1.4, 73.28, 0.69, 8.05, 0.0, 0.24, 1),
 (36, 1.51567, 13.29, 3.45, 1.21, 72.74, 0.56, 8.57, 0.0, 0.0, 1),
 (71, 1.51574, 14.86, 3.67, 1.74, 71.87, 0.16, 7.36, 0.0, 0.12, 2)]

### SORTING

In [22]:
cursor.execute('select * from glassdata order by col3 desc')
cursor.fetchmany(10)

[(185, 1.51115, 17.38, 0.0, 0.34, 75.41, 0.0, 6.65, 0.0, 0.0, 6),
 (190, 1.52365, 15.79, 1.83, 1.31, 70.43, 0.31, 8.61, 1.68, 0.0, 7),
 (201, 1.51508, 15.15, 0.0, 2.25, 73.5, 0.0, 8.34, 0.63, 0.0, 7),
 (200, 1.51609, 15.01, 0.0, 2.51, 73.05, 0.05, 8.83, 0.53, 0.0, 7),
 (182, 1.51888, 14.99, 0.78, 1.74, 72.5, 0.0, 9.95, 0.0, 0.0, 6),
 (205, 1.51617, 14.95, 0.0, 2.27, 73.3, 0.0, 8.71, 0.67, 0.0, 7),
 (206, 1.51732, 14.95, 0.0, 1.8, 72.99, 0.0, 8.61, 1.55, 0.0, 7),
 (207, 1.51645, 14.94, 0.0, 1.87, 73.11, 0.0, 8.67, 1.38, 0.0, 7),
 (211, 1.51685, 14.92, 0.0, 1.99, 73.06, 0.0, 8.4, 1.59, 0.0, 7),
 (71, 1.51574, 14.86, 3.67, 1.74, 71.87, 0.16, 7.36, 0.0, 0.12, 2)]

### SUBQUERIES

In [23]:
cursor.execute('select * from (select * from glassdata where col1>120) as temp where col11 = 3')
cursor.fetchmany(10)

[(147, 1.51769, 13.65, 3.66, 1.11, 72.77, 0.11, 8.6, 0.0, 0.0, 3),
 (148, 1.5161, 13.33, 3.53, 1.34, 72.67, 0.56, 8.33, 0.0, 0.0, 3),
 (149, 1.5167, 13.24, 3.57, 1.38, 72.7, 0.56, 8.44, 0.0, 0.1, 3),
 (150, 1.51643, 12.16, 3.52, 1.35, 72.89, 0.57, 8.53, 0.0, 0.0, 3),
 (151, 1.51665, 13.14, 3.45, 1.76, 72.48, 0.6, 8.38, 0.0, 0.17, 3),
 (152, 1.52127, 14.32, 3.9, 0.83, 71.5, 0.0, 9.49, 0.0, 0.0, 3),
 (153, 1.51779, 13.64, 3.65, 0.65, 73.0, 0.06, 8.93, 0.0, 0.0, 3),
 (154, 1.5161, 13.42, 3.4, 1.22, 72.69, 0.59, 8.32, 0.0, 0.0, 3),
 (155, 1.51694, 12.86, 3.58, 1.31, 72.61, 0.61, 8.79, 0.0, 0.0, 3),
 (156, 1.51646, 13.04, 3.4, 1.26, 73.01, 0.52, 8.58, 0.0, 0.0, 3)]

In [24]:
cursor.execute('select col2, count(col2) as cnt from glassdata group by col2 HAVING COUNT(COL2) > 2 order by count(col2) desc')
cursor.fetchmany(10)

[(1.52152, 3), (1.5159, 3), (1.51645, 3)]

### TASK
- download a data set from attached URL https://archive.ics.uci.edu/ml/datasets/Car+Evaluation
- create a database called CARDATASET
- create a table called CAR with column names given in dataset description
- dump all the data into CAR table
- check whether data is available in a table
- group all the data with COL1 and count occurences of each and every record based on COL1 value
- filter a record where COL3 value is 4
- update COL3 value with value 8 instead of 2
- delete a table
- delete a database

### create a database called CARDATASET

In [25]:
cursor.execute('CREATE DATABASE CARDATASET')

In [26]:
cursor.execute('show databases')
cursor.fetchall()

[('CARDATASET',),
 ('fsds',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sys',)]

In [27]:
cursor.execute('use CARDATASET')

### create a table called CAR with column names given in dataset description

In [28]:
cursor.execute('create table CAR(buying VARCHAR(6), maint VARCHAR(6), doors VARCHAR(6), persons VARCHAR(4), lug_boot VARCHAR(5), safety VARCHAR(4), class VARCHAR(6))')

### dump all the data into CAR table

In [29]:
import pandas as pd
car_data = pd.read_csv('data/car.data', index_col=False, delimiter = ',')
car_data.head()

   vhigh vhigh.1  2 2.1  small   low  unacc
0  vhigh   vhigh  2   2  small   med  unacc
1  vhigh   vhigh  2   2  small  high  unacc
2  vhigh   vhigh  2   2    med   low  unacc
3  vhigh   vhigh  2   2    med   med  unacc
4  vhigh   vhigh  2   2    med  high  unacc

In [30]:
import mysql.connector as conn
from mysql.connector import Error
try:
    mydb = conn.connect(host='localhost', database='CARDATASET', user='root', password='12345678')
    if mydb.is_connected():
        cursor = mydb.cursor(buffered=True)
        cursor.execute("select database();")
        record = cursor.fetchone()
        print("You're connected to database: ", record)
        cursor.execute('DROP TABLE IF EXISTS CAR;')
        print('Creating table....')
# in the below line please pass the create table statement which you want #to create
        cursor.execute("create table CAR(buying VARCHAR(6), maint VARCHAR(6), doors VARCHAR(6), persons VARCHAR(4), lug_boot VARCHAR(5), safety VARCHAR(4), class VARCHAR(6))")
        print("Table is created....")
        #loop through the data frame
        for i,row in car_data.iterrows():
            #here %S means string values 
            sql = "INSERT INTO CARDATASET.CAR VALUES (%s,%s,%s,%s,%s,%s,%s)"
            cursor.execute(sql, tuple(row))
            # print("Record inserted")
            # the connection is not auto committed by default, so we must commit to save our changes
            mydb.commit()
except Error as e:
            print("Error while connecting to MySQL", e)

print('DATA INSERTED')

You're connected to database:  ('cardataset',)
Creating table....
Table is created....
DATA INSERTED

### check whether data is available in a table

In [31]:
cursor.execute('select * from cardataset.car')
cursor.fetchmany(10)

[('vhigh', 'vhigh', '2', '2', 'small', 'med', 'unacc'),
 ('vhigh', 'vhigh', '2', '2', 'small', 'high', 'unacc'),
 ('vhigh', 'vhigh', '2', '2', 'med', 'low', 'unacc'),
 ('vhigh', 'vhigh', '2', '2', 'med', 'med', 'unacc'),
 ('vhigh', 'vhigh', '2', '2', 'med', 'high', 'unacc'),
 ('vhigh', 'vhigh', '2', '2', 'big', 'low', 'unacc'),
 ('vhigh', 'vhigh', '2', '2', 'big', 'med', 'unacc'),
 ('vhigh', 'vhigh', '2', '2', 'big', 'high', 'unacc'),
 ('vhigh', 'vhigh', '2', '4', 'small', 'low', 'unacc'),
 ('vhigh', 'vhigh', '2', '4', 'small', 'med', 'unacc')]

### group all the data with COL1 and count occurences of each and every record based on COL1 value

In [32]:
cursor.execute('select buying, count(buying) as BCNT from cardataset.car group by buying order by count(buying) desc')
cursor.fetchall()

[('high', 432), ('med', 432), ('low', 432), ('vhigh', 431)]

### filter a record where COL3 value is 4

In [33]:
cursor.execute('select * from cardataset.car where doors = 4')
cursor.fetchmany(10)

[('vhigh', 'vhigh', '4', '2', 'small', 'low', 'unacc'),
 ('vhigh', 'vhigh', '4', '2', 'small', 'med', 'unacc'),
 ('vhigh', 'vhigh', '4', '2', 'small', 'high', 'unacc'),
 ('vhigh', 'vhigh', '4', '2', 'med', 'low', 'unacc'),
 ('vhigh', 'vhigh', '4', '2', 'med', 'med', 'unacc'),
 ('vhigh', 'vhigh', '4', '2', 'med', 'high', 'unacc'),
 ('vhigh', 'vhigh', '4', '2', 'big', 'low', 'unacc'),
 ('vhigh', 'vhigh', '4', '2', 'big', 'med', 'unacc'),
 ('vhigh', 'vhigh', '4', '2', 'big', 'high', 'unacc'),
 ('vhigh', 'vhigh', '4', '4', 'small', 'low', 'unacc')]

### update COL3 value with value 8 instead of 2

In [34]:
cursor.execute('update cardataset.car set doors = "8" where doors = "2"')
mydb.commit()
cursor.execute('select * from cardataset.car where doors = "2"')
cursor.fetchall()

[]

### delete a table

In [35]:
cursor.execute('drop table cardataset.car')

### delete a database

In [36]:
cursor.execute('drop database cardataset')
cursor.execute('drop database fsds')